In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
data = Series(['one','two',np.nan,'four'])

In [4]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
# now we can use isnull() method to checkout if there is any missing value in DataSet
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
#we can also drop the value which is null using dropna() method
data.dropna()

0     one
1     two
3    four
dtype: object

In [7]:
#similearly we can do this with DataFrame
dframe1 =  DataFrame([[1,2,4],[np.nan,3,4],[5,6,np.nan],[np.nan,np.nan]])
dframe1

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [9]:
# SEE cArefullY , in third row there is no value we have added but it is still taking it and considering Nan,Let's
# do this with more other things.
dframe1 =  DataFrame([[1,2,4],[np.nan,3,4],[5,np.nan],[np.nan,np.nan]])
dframe1

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  NaN  NaN
3  NaN  NaN  NaN

In [10]:
#now same here for [5,np.nan] it is taking it as Nan automatically
dframe2 = DataFrame([[1,2,4],[np.nan,3,4],[5,6,np.nan],[np.nan,np.nan]])

In [11]:
dframe2

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [14]:
# drop rows containing all null values 
dframe2.dropna(how='all')

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN

In [16]:
# drop all rows containing any null value 
dframe2.dropna(how='any')

     0    1    2
0  1.0  2.0  4.0

In [17]:
dframe2.dropna(thresh=1)

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN

In [18]:
dframe2.dropna(thresh=2)

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN

In [20]:
dframe2.dropna(thresh=3)
# thresh is used to find out row having atleast 3 contents atleast

     0    1    2
0  1.0  2.0  4.0

In [26]:
dframe2.dropna(inplace =False)

     0    1    2
0  1.0  2.0  4.0

In [27]:
dframe2

     0    1    2
0  1.0  2.0  4.0

In [28]:
dframe3 = DataFrame([[1,2,4],[np.nan,3,4],[5,6,np.nan],[np.nan,np.nan]])

In [29]:
dframe3.dropna(inplace =False)

     0    1    2
0  1.0  2.0  4.0

In [31]:
dframe3

     0    1    2
0  1.0  2.0  4.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [33]:
dframe3.fillna(0)

     0    1    2
0  1.0  2.0  4.0
1  0.0  3.0  4.0
2  5.0  6.0  0.0
3  0.0  0.0  0.0

In [34]:
dframe3.fillna(23)

      0     1     2
0   1.0   2.0   4.0
1  23.0   3.0   4.0
2   5.0   6.0  23.0
3  23.0  23.0  23.0

In [35]:
# now fill specific values for specified columns
dframe3.fillna({0:34,1:45,2:99})

      0     1     2
0   1.0   2.0   4.0
1  34.0   3.0   4.0
2   5.0   6.0  99.0
3  34.0  45.0  99.0